# modules/constants.py

COLOR_MAP = {
    "빨강": [255, 0, 0],
    "주황": [255, 165, 0],
    "노랑": [255, 255, 0],
    "연두": [178, 255, 102],
    "초록": [0, 128, 0],
    "민트": [170, 240, 209],
    "파랑": [0, 0, 255],
    "남색": [0, 0, 128],
    "보라": [128, 0, 128],
    "핑크": [255, 192, 203],
    "갈색": [165, 42, 42],
    "베이지": [245, 245, 220],
    "흰색": [255, 255, 255],
    "회색": [128, 128, 128],
    "검정": [0, 0, 0]
}

STYLE_OPTIONS = [
    "미니멀룩", 
    "스트릿패션", 
    "보헤미안룩", 
    "럭셔리룩", 
    "아방가르드룩", 
    "러블리룩", 
    "빈티지룩", 
    "스포티룩", 
    "모던룩", 
    "그런지룩",
    "프레피룩"
]
